rottenpotatoes/app/controllers/movies_controller.rb

  def similar
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id) # look up movie by unique ID
    # will render app/views/movies/show.<extension> by default
    @movies = @movie.movies_with_same_director
    unless @movies.nil? || @movies.empty?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ? AND ("movies"."id" != ?)  [["director", "test"], ["id", 1]]
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = ? AND ("movies"."id" != ?)  [["director", "test"], ["id", 1]]

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "release_date", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)